#include "usrinc.h"

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//|          |
//| 函数名称 |: CLKO_Init
//| 功能描述 |:
//|          |:
//| 参数列表 |:
//|          |:
//| 返    回 |:
//|          |:
//| 备注信息 |:
//|          |:
////////////////////////////////////////////////////////////////////////////////
bool_t CLKO_Init(void)
{
  // 将P2.5配置为CLKOUT管脚
  HW_SetPinFunc(2, 5, PIN_FUNC7);
  HW_GpioSetDir(2, 5, TRUE);
  // 选择系统PLL作为CLKOUT时钟源
  outl(1, HW_OUTCLKSEL);
  // 10分频，得到48MHZ
  outl(10, HW_OUTCLKDIV);
  // 改变CLKOUT时钟源
  outl(0, HW_OUTCLKUEN);
  outl(1, HW_OUTCLKUEN);
  
  return TRUE;
}



