#include "usrinc.h"
#include "ASM9260T.h"

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//|          |
//| 函数名称 |: HW_PinMuxInit
//| 功能描述 |:
//|          |:
//| 参数列表 |:
//|          |:
//| 返    回 |:
//|          |:
//| 备注信息 |:
//|          |:
////////////////////////////////////////////////////////////////////////////////
bool_t HW_PinMuxInit(void)
{
  outl(((1<<25)|(1<<4)), REG_SET(HW_AHBCLKCTRL0));  // IOCONFIG,GPIO模块时钟使能
  return TRUE;
}

////////////////////////////////////////////////////////////////////////////////
//|          |
//| 函数名称 |: HW_SetPinFunc
//| 功能描述 |: 设置管脚的功能选择。
//|          |:
//| 参数列表 |:
//|          |:
//| 返    回 |:
//|          |:
//| 备注信息 |:
//|          |:
////////////////////////////////////////////////////////////////////////////////
void HW_SetPinFunc(u32_t port, u32_t pin, u32_t mux_type)
{
  u32_t val, addr;
  
  addr = HW_IOCON(port, pin);
  val  = (inl(addr) & ~(7u));
  val |= (mux_type & 7u);
  outl(val, addr);
}

////////////////////////////////////////////////////////////////////////////////
//|          |
//| 函数名称 |: HW_SetPinMode
//| 功能描述 |: 设置管脚的上拉/下拉电阻使能。
//|          |:
//| 参数列表 |:
//|          |:
//| 返    回 |:
//|          |:
//| 备注信息 |:
//|          |:
////////////////////////////////////////////////////////////////////////////////
void HW_SetPinMode(u32_t port, u32_t pin, u32_t mode)
{
  u32_t val, addr;
  
  addr = HW_IOCON(port, pin);
  val  = (inl(addr) & ~(3u<<3));
  val |= ((mode&3) << 3);
  outl(val, addr);
}

